---
kind: method
id: M:Autodesk.Revit.DB.Structure.LoadCombination.GetComponents
source: html/f90551cc-930a-2b43-7965-109c16833c78.htm
---
# Autodesk.Revit.DB.Structure.LoadCombination.GetComponents Method

Returns collection of the load combination components.

## Syntax (C#)
```csharp
public IList<LoadComponent> GetComponents()
```

## Returns
A collection of the load combination components.